
<p><code class="language-text">!heap -S</code> コマンドの出力結果を見ると、3 つのヒープのうち <code class="language-text">0x1f1adb90000</code> のヒープのサイズが非常に大きくなっており、このヒープが肥大化していることがわかります。</p>
<p>また、異なる観点での情報を得るため <code class="language-text">!heap -a</code> コマンドを実行してみます。</p>
<p><span
      class="gatsby-resp-image-wrapper"
      style="position: relative; display: block; margin-left: auto; margin-right: auto; max-width: 500px; "
    >
      <a
    class="gatsby-resp-image-link"
    href="/static/3a96e857210015c6994a2a0b58df3a4e/0b533/app-heap-002.png"
    style="display: block"
    target="_blank"
    rel="noopener"
  >
    <span
    class="gatsby-resp-image-background-image"
    style="padding-bottom: 27.500000000000004%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAGCAYAAADDl76dAAAACXBIWXMAAA7EAAAOxAGVKw4bAAAA/UlEQVQY03WQzYqDQBCEff93UiEao4nGPxRB0ahoUIMiesuhluplYC870FbLdH9d01rbtqiqCr7v4/P5YNs28Hy/X8zzjHVdcZ4n9n3HcRxSw///jtb3PfI8RxRFCIIAWZYJqK5riWmaZCAHN02DsiwxjiPe77fosiwyhMFcI+R+v2MYBsRxDNM0BWwYBh6PB7qug67rUuN5HhzHQZqmopfLRYwkSSK9z+fzF3i9XsUNL23bFrUsS8Cv10samd9uN7iui6IoZABzglivXqjRBSFsVEBOosO/QAK4ZypXRBOsJTAMQwkB8kP7CkhnfAKVAO5OAdV6FJBBoHLJ+x9PpKUPK3X8mQAAAABJRU5ErkJggg=='); background-size: cover; display: block;"
  ></span>
  <picture>
          <source
              srcset="/static/3a96e857210015c6994a2a0b58df3a4e/8ac56/app-heap-002.webp 240w,
/static/3a96e857210015c6994a2a0b58df3a4e/d3be9/app-heap-002.webp 480w,
/static/3a96e857210015c6994a2a0b58df3a4e/b0a15/app-heap-002.webp 500w"
              sizes="(max-width: 500px) 100vw, 500px"
              type="image/webp"
            />
          <source
            srcset="/static/3a96e857210015c6994a2a0b58df3a4e/8ff5a/app-heap-002.png 240w,
/static/3a96e857210015c6994a2a0b58df3a4e/e85cb/app-heap-002.png 480w,
/static/3a96e857210015c6994a2a0b58df3a4e/0b533/app-heap-002.png 500w"
            sizes="(max-width: 500px) 100vw, 500px"
            type="image/png"
          />
          <img
            class="gatsby-resp-image-image"
            src="/static/3a96e857210015c6994a2a0b58df3a4e/0b533/app-heap-002.png"
            alt="!heap -a コマンドでヒープのセグメント情報を表示"
            title="!heap -a コマンドでヒープのセグメント情報を表示"
            loading="lazy"
            style="width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;"
          />
        </picture>
  </a>
    </span></p>
<p><code class="language-text">!heap -a</code> コマンドを実行してみると、<code class="language-text">!heap -S</code> コマンドで確認した <code class="language-text">0x1f1adb90000</code> のヒープに 84 個のセグメントが存在していることを確認できます。(<code class="language-text">Segment at</code> から始まる行が 1 つのセグメントと対応します)</p>
<p>Windows システムでは、NT Heap は <code class="language-text">ntdll!_HEAP</code> 構造体によって管理されます。<sup id="fnref-9"><a href="#fn-9" class="footnote-ref">9</a></sup></p>
<p>プロセスダンプをロードした WinDbg で <code class="language-text">dt ntdll!_HEAP</code> コマンドを実行して <code class="language-text">ntdll!_HEAP</code> 構造体の情報を参照してみます。</p>
<div class="gatsby-highlight" data-language="text"><pre class="language-text"><code class="language-text">0:000> dt ntdll!_HEAP
  +0x000 Segment          : _HEAP_SEGMENT
  +0x000 Entry            : _HEAP_ENTRY
  +0x010 SegmentSignature : Uint4B
  +0x014 SegmentFlags     : Uint4B
  +0x018 SegmentListEntry : _LIST_ENTRY
  +0x028 Heap             : Ptr64 _HEAP
  +0x030 BaseAddress      : Ptr64 Void
  +0x038 NumberOfPages    : Uint4B
  +0x040 FirstEntry       : Ptr64 _HEAP_ENTRY
  +0x048 LastValidEntry   : Ptr64 _HEAP_ENTRY
{{ 省略 }}</code></pre></div>
<p>上記のように、<code class="language-text">ntdll!_HEAP</code> 構造体は <code class="language-text">ntdll!_HEAP_SEGMENT</code> 構造体と <code class="language-text">ntdll!_HEAP_ENTRY</code> 構造体から始まっています。</p>
<p>さらに、<code class="language-text">ntdll!_HEAP_SEGMENT</code> 構造体と <code class="language-text">ntdll!_HEAP_ENTRY</code> 構造体の情報を参照してみます。</p>
<div class="gatsby-highlight" data-language="text"><pre class="language-text"><code class="language-text"># ntdll!_HEAP_SEGMENT の構造体情報をダンプ
0:000> dt ntdll!_HEAP_SEGMENT
 +0x000 Entry            : _HEAP_ENTRY
 +0x010 SegmentSignature : Uint4B
 +0x014 SegmentFlags     : Uint4B
 +0x018 SegmentListEntry : _LIST_ENTRY
 +0x028 Heap             : Ptr64 _HEAP
 +0x030 BaseAddress      : Ptr64 Void
 +0x038 NumberOfPages    : Uint4B
 +0x040 FirstEntry       : Ptr64 _HEAP_ENTRY
 +0x048 LastValidEntry   : Ptr64 _HEAP_ENTRY
 +0x050 NumberOfUnCommittedPages : Uint4B
 +0x054 NumberOfUnCommittedRanges : Uint4B
 +0x058 SegmentAllocatorBackTraceIndex : Uint2B
 +0x05a Reserved         : Uint2B
 +0x060 UCRSegmentList   : _LIST_ENTRY

# ntdll!_HEAP_ENTRY の構造体情報をダンプ
0:000> dt ntdll!_HEAP_ENTRY 
 +0x000 UnpackedEntry    : _HEAP_UNPACKED_ENTRY
 +0x000 PreviousBlockPrivateData : Ptr64 Void
 +0x008 Size             : Uint2B
 +0x00a Flags            : UChar
 +0x00b SmallTagIndex    : UChar
 +0x008 SubSegmentCode   : Uint4B
 +0x00c PreviousSize     : Uint2B
 +0x00e SegmentOffset    : UChar
 +0x00e LFHFlags         : UChar
 +0x00f UnusedBytes      : UChar
 +0x008 CompactHeader    : Uint8B
 +0x000 ExtendedEntry    : _HEAP_EXTENDED_ENTRY
 +0x000 Reserved         : Ptr64 Void
 +0x008 FunctionIndex    : Uint2B
 +0x00a ContextValue     : Uint2B
 +0x008 InterceptorValue : Uint4B
 +0x00c UnusedBytesLength : Uint2B
 +0x00e EntryOffset      : UChar
 +0x00f ExtendedBlockSignature : UChar
 +0x000 ReservedForAlignment : Ptr64 Void
 +0x008 Code1            : Uint4B
 +0x00c Code2            : Uint2B
 +0x00e Code3            : UChar
 +0x00f Code4            : UChar
 +0x00c Code234          : Uint4B
 +0x008 AgregateCode     : Uint8B</code></pre></div>
<p>上記の情報から、<code class="language-text">ntdll!_HEAP</code> 構造体は <code class="language-text">ntdll!_HEAP_ENTRY</code> 構造体を含む <code class="language-text">ntdll!_HEAP_SEGMENT</code> 構造体から構成されていることがわかります。</p>
<p>Windows のバージョンが XP 以下の場合は、<code class="language-text">ntdll!_HEAP_ENTRY</code> 構造体の Size の値を 8 倍したアドレスを加算していくことでプロセス内の特定のヒープセグメント内の <code class="language-text">ntdll!_HEAP_ENTRY</code> 構造体を辿ることができます。<sup id="fnref-10"><a href="#fn-10" class="footnote-ref">10</a></sup></p>
<p>しかし、Vista 以降のバージョンでは ASLR によるプロセスヒープのランダム化が行われているため、この方法は使用できません。<sup id="fnref-11"><a href="#fn-11" class="footnote-ref">11</a></sup></p>
<p>そのため、ヒープセグメント内の <code class="language-text">ntdll!_HEAP_ENTRY</code> 構造体を辿るためには、<code class="language-text">!heap</code> 拡張機能を使用します。</p>
